In [1]:
import pyspark

In [3]:
from pyspark.sql import SparkSession

In [4]:
spark = SparkSession.builder.appName('DataFrame2').getOrCreate()

In [5]:
spark

# Handling Missing Values

- Dropping Columns
- Dropping Rows
- Various Parameters in Dropping functionalities
- Handling Missing values by Mean

In [7]:
df = spark.read.csv('test2.csv', header = True, inferSchema = True)

In [8]:
df.show()

+--------+----+----------+-----------+------+
|    Name| Age|Experience|   Location|Salary|
+--------+----+----------+-----------+------+
|  Priyam|  23|         2|  Bangalore|125000|
|  Kartik|  23|         2|      Noida| 66000|
| Kshitiz|  22|         1|     Mumbai| 25000|
|Akanksha|  24|         2|  Bangalore| 60000|
|   Akhil|  23|         2|  Bangalore| 70000|
|   Rohit|NULL|         1|       NULL|  NULL|
|   Anmol|  22|         1|  Hyderabad| 40000|
|  Sameer|NULL|      NULL|       NULL| 50000|
|   Sakib|  22|         1|     Mumbai| 25000|
| Prateek|  23|         0|Robertsganj|     0|
|    NULL|  25|      NULL|       NULL|  NULL|
|    NULL|  22|      NULL|       NULL|  NULL|
+--------+----+----------+-----------+------+

## Dropping Columns

In [10]:
# df.drop('Column Name')

df.drop('Location').show()

+--------+----+----------+------+
|    Name| Age|Experience|Salary|
+--------+----+----------+------+
|  Priyam|  23|         2|125000|
|  Kartik|  23|         2| 66000|
| Kshitiz|  22|         1| 25000|
|Akanksha|  24|         2| 60000|
|   Akhil|  23|         2| 70000|
|   Rohit|NULL|         1|  NULL|
|   Anmol|  22|         1| 40000|
|  Sameer|NULL|      NULL| 50000|
|   Sakib|  22|         1| 25000|
| Prateek|  23|         0|     0|
|    NULL|  25|      NULL|  NULL|
|    NULL|  22|      NULL|  NULL|
+--------+----+----------+------+

## Dropping Null Values

In [11]:
df.show()

+--------+----+----------+-----------+------+
|    Name| Age|Experience|   Location|Salary|
+--------+----+----------+-----------+------+
|  Priyam|  23|         2|  Bangalore|125000|
|  Kartik|  23|         2|      Noida| 66000|
| Kshitiz|  22|         1|     Mumbai| 25000|
|Akanksha|  24|         2|  Bangalore| 60000|
|   Akhil|  23|         2|  Bangalore| 70000|
|   Rohit|NULL|         1|       NULL|  NULL|
|   Anmol|  22|         1|  Hyderabad| 40000|
|  Sameer|NULL|      NULL|       NULL| 50000|
|   Sakib|  22|         1|     Mumbai| 25000|
| Prateek|  23|         0|Robertsganj|     0|
|    NULL|  25|      NULL|       NULL|  NULL|
|    NULL|  22|      NULL|       NULL|  NULL|
+--------+----+----------+-----------+------+

In [12]:
df.na.drop().show()
# IF no parameters, all the rows with null values will be dropped

+--------+---+----------+-----------+------+
|    Name|Age|Experience|   Location|Salary|
+--------+---+----------+-----------+------+
|  Priyam| 23|         2|  Bangalore|125000|
|  Kartik| 23|         2|      Noida| 66000|
| Kshitiz| 22|         1|     Mumbai| 25000|
|Akanksha| 24|         2|  Bangalore| 60000|
|   Akhil| 23|         2|  Bangalore| 70000|
|   Anmol| 22|         1|  Hyderabad| 40000|
|   Sakib| 22|         1|     Mumbai| 25000|
| Prateek| 23|         0|Robertsganj|     0|
+--------+---+----------+-----------+------+

### how parameter

In [13]:
df.na.drop(how = 'any').show()

# Same as drop command with no params

+--------+---+----------+-----------+------+
|    Name|Age|Experience|   Location|Salary|
+--------+---+----------+-----------+------+
|  Priyam| 23|         2|  Bangalore|125000|
|  Kartik| 23|         2|      Noida| 66000|
| Kshitiz| 22|         1|     Mumbai| 25000|
|Akanksha| 24|         2|  Bangalore| 60000|
|   Akhil| 23|         2|  Bangalore| 70000|
|   Anmol| 22|         1|  Hyderabad| 40000|
|   Sakib| 22|         1|     Mumbai| 25000|
| Prateek| 23|         0|Robertsganj|     0|
+--------+---+----------+-----------+------+

In [16]:
df.na.drop(how = 'all').show()

# Will only drop the rows with all NULL values only.

+--------+----+----------+-----------+------+
|    Name| Age|Experience|   Location|Salary|
+--------+----+----------+-----------+------+
|  Priyam|  23|         2|  Bangalore|125000|
|  Kartik|  23|         2|      Noida| 66000|
| Kshitiz|  22|         1|     Mumbai| 25000|
|Akanksha|  24|         2|  Bangalore| 60000|
|   Akhil|  23|         2|  Bangalore| 70000|
|   Rohit|NULL|         1|       NULL|  NULL|
|   Anmol|  22|         1|  Hyderabad| 40000|
|  Sameer|NULL|      NULL|       NULL| 50000|
|   Sakib|  22|         1|     Mumbai| 25000|
| Prateek|  23|         0|Robertsganj|     0|
|    NULL|  25|      NULL|       NULL|  NULL|
|    NULL|  22|      NULL|       NULL|  NULL|
+--------+----+----------+-----------+------+

### threshold parameter

The value of threshold means that at-least that many non null values must be there in the row, if not then the row will be dropped.

In [20]:
df.na.drop(how = 'any', thresh = 2).show()

+--------+----+----------+-----------+------+
|    Name| Age|Experience|   Location|Salary|
+--------+----+----------+-----------+------+
|  Priyam|  23|         2|  Bangalore|125000|
|  Kartik|  23|         2|      Noida| 66000|
| Kshitiz|  22|         1|     Mumbai| 25000|
|Akanksha|  24|         2|  Bangalore| 60000|
|   Akhil|  23|         2|  Bangalore| 70000|
|   Rohit|NULL|         1|       NULL|  NULL|
|   Anmol|  22|         1|  Hyderabad| 40000|
|  Sameer|NULL|      NULL|       NULL| 50000|
|   Sakib|  22|         1|     Mumbai| 25000|
| Prateek|  23|         0|Robertsganj|     0|
+--------+----+----------+-----------+------+

### subset parameter

Only drops rows which have NULL values in the specified column.

In [21]:
df.na.drop(how = 'any', subset = ['Experience']).show()

+--------+----+----------+-----------+------+
|    Name| Age|Experience|   Location|Salary|
+--------+----+----------+-----------+------+
|  Priyam|  23|         2|  Bangalore|125000|
|  Kartik|  23|         2|      Noida| 66000|
| Kshitiz|  22|         1|     Mumbai| 25000|
|Akanksha|  24|         2|  Bangalore| 60000|
|   Akhil|  23|         2|  Bangalore| 70000|
|   Rohit|NULL|         1|       NULL|  NULL|
|   Anmol|  22|         1|  Hyderabad| 40000|
|   Sakib|  22|         1|     Mumbai| 25000|
| Prateek|  23|         0|Robertsganj|     0|
+--------+----+----------+-----------+------+

## Filling the Missing Values

### fill parameters fills a value in the place of NULL values and we can also fill values in a specific column too.

In [25]:
df.na.fill('Missing Value').show()

+-------------+----+----------+-------------+------+
|         Name| Age|Experience|     Location|Salary|
+-------------+----+----------+-------------+------+
|       Priyam|  23|         2|    Bangalore|125000|
|       Kartik|  23|         2|        Noida| 66000|
|      Kshitiz|  22|         1|       Mumbai| 25000|
|     Akanksha|  24|         2|    Bangalore| 60000|
|        Akhil|  23|         2|    Bangalore| 70000|
|        Rohit|NULL|         1|Missing Value|  NULL|
|        Anmol|  22|         1|    Hyderabad| 40000|
|       Sameer|NULL|      NULL|Missing Value| 50000|
|        Sakib|  22|         1|       Mumbai| 25000|
|      Prateek|  23|         0|  Robertsganj|     0|
|Missing Value|  25|      NULL|Missing Value|  NULL|
|Missing Value|  22|      NULL|Missing Value|  NULL|
+-------------+----+----------+-------------+------+

Always check data type of columns.

You cannot fill string values in the column of numeric data type.

In [29]:
df.na.fill(00, ['Age']).show()

+--------+---+----------+-----------+------+
|    Name|Age|Experience|   Location|Salary|
+--------+---+----------+-----------+------+
|  Priyam| 23|         2|  Bangalore|125000|
|  Kartik| 23|         2|      Noida| 66000|
| Kshitiz| 22|         1|     Mumbai| 25000|
|Akanksha| 24|         2|  Bangalore| 60000|
|   Akhil| 23|         2|  Bangalore| 70000|
|   Rohit|  0|         1|       NULL|  NULL|
|   Anmol| 22|         1|  Hyderabad| 40000|
|  Sameer|  0|      NULL|       NULL| 50000|
|   Sakib| 22|         1|     Mumbai| 25000|
| Prateek| 23|         0|Robertsganj|     0|
|    NULL| 25|      NULL|       NULL|  NULL|
|    NULL| 22|      NULL|       NULL|  NULL|
+--------+---+----------+-----------+------+

## Handling Missing Values

In [36]:
types = []
types = df.dtypes

In [35]:
types

[('Name', 'string'),
 ('Age', 'int'),
 ('Experience', 'int'),
 ('Location', 'string'),
 ('Salary', 'int')]

### Working of Imputer Function


1. Importing the Imputer class:

    ```from pyspark.ml.feature import Imputer```
    This line imports the Imputer class from the pyspark.ml.feature module, which is used for handling missing values in PySpark DataFrames.

2. Creating an Imputer object:

    ```imputer = Imputer(inputCols=['Age', 'Experience', 'Salary'], outputCols=['Age_imputed', 'Experience_imputed', 'Salary_imputed'])```
    This line creates an instance of the Imputer class with the following parameters:
    inputCols: A list specifying the names of the columns in the DataFrame that contain missing values. In this case, it's targeting the columns Age, Experience, and Salary.

    ```outputCols```: A list specifying the names of the new columns that will be created to hold the imputed values. Here, it creates columns named Age_imputed, Experience_imputed, and Salary_imputed.

3. Setting the imputation strategy:

    ```.setStrategy('mean')```
    This line sets the strategy to use for imputing missing values. The mean strategy specifies that missing values will be filled with the mean (average) of the non-missing values in each column.

4. Applying the Imputer:

    While not shown in the provided code, the Imputer is typically applied to a DataFrame using a two-step process:
    Fitting: ```imputer_model = imputer.fit(df)```
    This calculates the necessary statistics (like the mean for each column in this case) based on the provided DataFrame (df).

    Transforming: ```df_imputed = imputer_model.transform(df)```
    This applies the learned imputation rules to fill in missing values in the DataFrame, creating a new DataFrame (df_imputed) with the imputed columns.

In [48]:
from pyspark.ml.feature import Imputer

imputer = Imputer (
    inputCols = ['Age', 'Experience', 'Salary'],
    outputCols = ['{}_new'.format(c) for c in ['Age', 'Experience', 'Salary']]
).setStrategy('mean')

### Adding imputated cols to dataFrame

In [49]:
imputer.fit(df).transform(df).show()

+--------+----+----------+-----------+------+-------+--------------+----------+
|    Name| Age|Experience|   Location|Salary|Age_new|Experience_new|Salary_new|
+--------+----+----------+-----------+------+-------+--------------+----------+
|  Priyam|  23|         2|  Bangalore|125000|     23|             2|    125000|
|  Kartik|  23|         2|      Noida| 66000|     23|             2|     66000|
| Kshitiz|  22|         1|     Mumbai| 25000|     22|             1|     25000|
|Akanksha|  24|         2|  Bangalore| 60000|     24|             2|     60000|
|   Akhil|  23|         2|  Bangalore| 70000|     23|             2|     70000|
|   Rohit|NULL|         1|       NULL|  NULL|     22|             1|     51222|
|   Anmol|  22|         1|  Hyderabad| 40000|     22|             1|     40000|
|  Sameer|NULL|      NULL|       NULL| 50000|     22|             1|     50000|
|   Sakib|  22|         1|     Mumbai| 25000|     22|             1|     25000|
| Prateek|  23|         0|Robertsganj|     0|     23|             0|         0|
|    NULL|  25|      NULL|       NULL|  NULL|     25|             1|     51222|
|    NULL|  22|      NULL|       NULL|  NULL|     22|             1|     51222|
+--------+----+----------+-----------+------+-------+--------------+----------+

In [47]:
df.show()

+--------+----+----------+-----------+------+
|    Name| Age|Experience|   Location|Salary|
+--------+----+----------+-----------+------+
|  Priyam|  23|         2|  Bangalore|125000|
|  Kartik|  23|         2|      Noida| 66000|
| Kshitiz|  22|         1|     Mumbai| 25000|
|Akanksha|  24|         2|  Bangalore| 60000|
|   Akhil|  23|         2|  Bangalore| 70000|
|   Rohit|NULL|         1|       NULL|  NULL|
|   Anmol|  22|         1|  Hyderabad| 40000|
|  Sameer|NULL|      NULL|       NULL| 50000|
|   Sakib|  22|         1|     Mumbai| 25000|
| Prateek|  23|         0|Robertsganj|     0|
|    NULL|  25|      NULL|       NULL|  NULL|
|    NULL|  22|      NULL|       NULL|  NULL|
+--------+----+----------+-----------+------+